{
  "work": [
    {
      "id": "1",
      "title": "Finance Tracker",
      "small_title": "Design & Development",
      "image": "images/dash.png",
      "full_image": [
        "images/dashboard.png",
        "images/transaction.png",
        "images/lesson.png",
        "images/profile.png",
        "images/admindash.png",
        "images/upload.png",
        "images/adminlesson.png"
      ],
      "techs": ["React", "Node.js", "Express", "MongoDB"],

      "small_description": "Developing a dynamic finance dashboard using MERN stack, featuring transaction tracking, goal setting, and personalized finance tips.",
      "description": "Finance tracker called FinSmart. It was built using the MERN stack, which helped in making a place where people can easily watch their spending and save up for things they want.",
      "learned": "From the FinSmart project, I improved my Node.js skills and learned to make things easier for users. I got better at coding with Node.js and understood how important it is to focus on what users need. Making the dashboard user-friendly was a big lesson for me.",
      "url": "https://github.com/iqrafarah/finsmart"
    },
    {
      "id": "2",
      "title": "Note IT",
      "image": "images/notes.png",
      "small_title": "Design & Development",
      "full_image": ["images/notes-full1.png", "images/notes-full2.png"],
      "techs": ["Html&css", "JavaScript"],
      "small_description": "For a school project a classmate and i created a notes app with JavaScript, HTML, and CSS. Used local storage for data persistence. Unique feature: voice input for dictating notes, converted to text and stored.",
      "description": "My classmate and I collaborated on a school assignment to create a notes app using JavaScript, HTML, and CSS. We utilized local storage to save data. One interesting feature we added was the ability to dictate notes using voice input and play them back. This feature allowed users to speak their notes, which would then be converted to text and stored. Additionally, users could listen to the recorded notes for playback.",
      "learned": "Making this notes app taught me how to add voice input and playback features.",
      "url": [
        "https://iqrafarah.github.io/notes/",
        "https://github.com/iqrafarah/notes"
      ]
    },
    {
      "id": "3",
      "title": "Movie Box",
      "small_title": "Design & Development",
      "image": "images/bios1.png",
      "full_image": [
        "images/bios1.png",
        "images/bios2.png",
        "images/bios3.png"
      ],
      "techs": ["Html&css", "JavaScript"],
      "small_description": "Discover our cinema app, where you can easily register, order your favorite movies, and cast your vote for our exciting Friday Movie Night selections.",
      "description": "Our teacher gave us the databases and APIs required for our cinema app. Users can register, log in, and order movies seamlessly. They can also search and vote for Friday Movie Night selections. Admins have the ability to create and delete movies, making the experience straightforward. We're using the provided databases and APIs to manage our film collection.",
      "learned": "I've learned the value of simplicity and accessibility. Creating an easy-to-use website is key. I focus on what makes sense and arrange features based on what users would find most useful.",
      "url": ["https://github.com/iqrafarah/Bioscoop-app"]
    },
    {
      "id": "4",
      "title": "Kras hosting",
      "small_title": "Design & Development",
      "image": "images/krashosting.png",
      "full_image": ["images/kras-full.png", "images/kras-full2.jpeg"],
      "techs": ["Html&css", "JavaScript"],
      "small_description": "Teamed up with three classmates for a school project—created a platform for ordering hosting packages. Implemented an admin dashboard to view all orders and blogs.",
      "description": "Kras Hosting was a school assignment with three classmates using the Scrum method for the first time. We reached about 90% completion, which felt like a win for our first attempt. Our website allowed users to order hosting packages. Throughout this project, we learned a ton. Using Scrum improved our task management, and adding an admin interface for orders, packages, and a blog was a big step for us.",
      "learned": "Trying out the Scrum method in our project taught me to break tasks into smaller parts, set short-term goals, and have regular team meetings for updates.",
      "url": [
        "https://krashosting-lite.tobiasvandeven.nl/",
        "https://github.com/Toby142/krashosting-frontend"
      ]
    },
    {
      "id": "5",
      "title": "Advokat Lawfirm",
      "small_title": "Design & Development",
      "image": "images/advokat.png",
      "full_image": ["images/advokat-full.jpeg", "images/advokat-full2.jpeg"],
      "techs": ["WordPress", "Elementor"],
      "small_description": "Building a law firm website with Elementor, using Flexbox for a smooth and user-friendly design.",
      "description": "Creating a law firm website using Elementor and Flexbox isn't entirely new to me I've tackled similar projects in the past. However, each experience brings its own unique challenges and opportunities for growth.",
      "learned": "I've gained a better understanding of using flexbox to create layouts that adapt well to different screens, making the website more user-friendly.",
      "url": "https://advokat.iqrafarah.nl/"
    }
  ]
}
