{
  "work": [
    {
      "id": "1",
      "title": "Advokat",
      "image": "images/advokat.png",
      "full_image": ["images/advokat-full.jpeg", "images/advokat-full2.jpeg"],
      "techs": ["WordPress", "Elementor"],
      "description": "Creating a law firm website using Elementor and Flexbox isn't entirely new to me—I've tackled similar projects in the past. However, each experience brings its own unique challenges and opportunities for growth.",
      "url": "https://advokat.iqrafarah.nl/"
    },
    {
      "id": "2",
      "title": "Ultra Edge",
      "image": "images/ultra.png",
      "full_image": "images/ultra-full.jpeg",
      "techs": ["WordPress", "Elementor"],
      "description": "Crafting a corporate website for practice using Elementor and Flexbox was an incredibly enriching experience. It provided me with invaluable insights into creating layouts and improving responsiveness by extensively utilizing Flexbox. This hands-on project not only enhanced my proficiency in WordPress but also deepened my expertise in developing user-friendly interfaces tailored for corporate environments.",
      "url": "https://ultra.iqrafarah.nl/"
    },
    {
      "id": "3",
      "title": "Note It",
      "image": "images/notes.png",
      "full_image": ["images/notes-full1.png", "images/notes-full2.png"],
      "techs": ["Html&css", "JavaScript"],
      "description": "My classmate and I collaborated on a school assignment to create a notes app using JavaScript, HTML, and CSS. We utilized local storage to save data. One interesting feature we added was the ability to dictate notes using voice input and play them back. This feature allowed users to speak their notes, which would then be converted to text and stored. Additionally, users could listen to the recorded notes for playback. It was an engaging functionality that introduced a unique way of creating and interacting with notes in the app.",
      "url": "https://iqrafarah.github.io/notes/"
    },
    {
      "id": "4",
      "title": "Adrienne",
      "image": "images/adrienne.png",
      "full_image": ["images/adrienne-full.jpeg", "images/adrienne-full2.jpeg"],
      "techs": ["WordPress", "Elementor"],
      "description": "Creating a website for practice using Elementor and Flexbox was a fantastic learning experience for me. I gained valuable insights into crafting layouts and enhancing responsiveness by working extensively with Flexbox. This hands-on project strengthened my WordPress skills and deepened my understanding of building user-friendly interfaces.",
      "url": "https://adrienne.iqrafarah.nl/"
    },
    {
      "id": "5",
      "title": "Kras hosting",
      "image": "images/krashosting.png",
      "full_image": ["images/kras-full.png", "images/kras-full2.jpeg"],
      "techs": ["Html&css", "JavaScript"],
      "description": "Kras Hosting was a collaborative school assignment with three classmates using the Scrum method for the first time. We reached about 90% completion, which felt like a win for our first attempt. Our website allowed users to order hosting packages. Throughout this project, we learned a ton. Using Scrum improved our task management, and adding an admin interface for orders, packages, and a blog was a big step for us.",
      "url": "https://krashosting-lite.tobiasvandeven.nl/"
    }
  ]
}
